rails-backend/app/controllers/api/v1/players_controller.rb

SELECT "players".* FROM "players"
---
			def index
				# render json: Player.includes(:quiz_card), include: ['quiz_card']
				@players = Player.all

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Quinn"], ["created_at", "2018-07-31 16:03:37.772436"], ["updated_at", "2018-07-31 16:03:37.772436"]]
---
			def create
				@player = Player.create(player_params)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "high_score" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["high_score", 4], ["updated_at", "2018-08-02 15:16:23.407663"], ["id", 1]]
---
			def update
				@player = Player.find(params[:id])
				@player.high_score = player_params[:high_score]
				@player.save