rails-backend/app/controllers/api/v1/quiz_cards_controller.rb

			def show
				@quizcard = QuizCard.find(params[:id])
---
SELECT  "quiz_cards".* FROM "quiz_cards" WHERE "quiz_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

			def index
				@quizcards = QuizCard.all
---
SELECT "quiz_cards".* FROM "quiz_cards"

			def create
				@quizcard = QuizCard.create(quiz_card_params)
---
INSERT INTO "quiz_cards" ("player_id", "option1", "option2", "option3", "false_option", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"